EDT/ZUP/zup_edt/src/InformationRegisters/КадровыеДокументыПоРешениям/КадровыеДокументыПоРешениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадровыеДокументыПоРешениям</name>
  <resources>
    <name>КадровыйДокумент</name>
    <type>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.ВосстановлениеВДолжности</types>
      <types>DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</types>
      <types>DocumentRef.КадровыйПереводСписком</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.УвольнениеСписком</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
    </type>
  </resources>
  <dimensions>
    <name>Решение</name>
    <type>
      <types>DefinedType.КадровоеРешение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/Documents/ВозвратИзОтпускаПоУходуЗаРебенком/ВозвратИзОтпускаПоУходуЗаРебенком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
  <basedOn>Document.ОтпускПоУходуЗаРебенком</basedOn>
  <basedOn>Document.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком</basedOn>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком</basedOn>
  <registerRecords>InformationRegister.ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьЗанятыеПозицииШтатногоРасписания</registerRecords>
  <registerRecords>InformationRegister.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.ДанныеСостоянийСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПрименениеПлановыхНачислений</registerRecords>
  <registerRecords>InformationRegister.ПлановыеАвансы</registerRecords>
  <registerRecords>InformationRegister.ЗанятостьПозицийШтатногоРасписания</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.РеестрОтпусков</registerRecords>
  <registerRecords>InformationRegister.БухучетПлановыхНачислений</registerRecords>
  <registerRecords>InformationRegister.ПараметрыПериодовСтажаПФР</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПФР</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьАванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачисленияУтверждены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗаниматьСтавку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправленныйДокумент</name>
    <type>
      <types>DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиРуководителя</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиГлавногоБухгалтера</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительКадровойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителяКадровойСлужбы</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиРуководителяКадровойСлужбы</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьЛьготы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапрета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>DocumentRef.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСНачислениямиИУдержаниями</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСНачислениямиИУдержаниями</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаАванса</name>
      <type>
        <types>EnumRef.СпособыРасчетаАванса</types>
      </type>
    </attributes>
    <attributes>
      <name>Аванс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПересчетТарифныхСтавок</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокРасчетаСтоимостиЕдиницыВремени</name>
      <type>
        <types>EnumRef.ПорядокРасчетаСтоимостиЕдиницыВремениОплатыТруда</types>
      </type>
    </attributes>
    <attributes>
      <name>СовокупнаяТарифнаяСтавка</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТарифнойСтавки</name>
      <type>
        <types>EnumRef.ВидыТарифныхСтавок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Льготы</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСНачислениямиИУдержаниями</types>
      </type>
    </attributes>
    <attributes>
      <name>Льгота</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/CommonModules/КадровыеРешения/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.13.54";
	Обработчик.Процедура = "КадровыеРешения.ЗаполнитьКадровыеДокументыПоРешениям";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("87676bf9-d384-47b3-a4fa-1430c73bea18");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение списка кадровых документов, введенных на основании решений.'");
	
КонецПроцедуры

#Область ОбменДанными

Процедура ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации) Экспорт
	
	// Метаданные.Документы.РешениеОКадровомПереводе
	НоваяСтрока = ДанныеРегистрации.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.Документы.РешениеОКадровомПереводе;
	
	// Метаданные.Документы.РешениеОПриемеНаРаботу
	НоваяСтрока = ДанныеРегистрации.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.Документы.РешениеОПриемеНаРаботу;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКадровыеДокументыПоРешениям(ПараметрыОбновления) Экспорт
	
	Запрос = ЗапросЗаполненияКадровыхДокументовПоРешениям();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбновлениеЗавершено = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбновлениеЗавершено = Ложь;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КадровыеДокументыПоРешениям.СоздатьНаборЗаписей();
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		НаборЗаписей.Отбор.Решение.Установить(Выборка.Решение);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапросЗаполненияКадровыхДокументовПоРешениям()
		
	ПустыеРешения = Новый Массив;
	Для Каждого ТипРешения Из Метаданные.ОпределяемыеТипы.КадровоеРешение.Тип.Типы() Цикл
		ПустыеРешения.Добавить(Новый(ТипРешения));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустыеРешения", ПустыеРешения);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ПриемНаРаботу КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ПриемНаРаботуСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.КадровыйПеревод КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.КадровыйПереводСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.Увольнение КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.УвольнениеСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ОтпускПоУходуЗаРебенком КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ВозвратИзОтпускаПоУходуЗаРебенком КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ВосстановлениеВДолжности КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL";
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти
